--- Book name translations for New Testament (books 40-66).
return {
    UBIO = {
        [40] = "Матвія", [41] = "Марка", [42] = "Луки", [43] = "Івана", [44] = "Дії",
        [45] = "Римлян", [46] = "1 Коринтян", [47] = "2 Коринтян", [48] = "Галатів", [49] = "Ефесян",
        [50] = "Филип'ян", [51] = "Колосян", [52] = "1 Солунян", [53] = "2 Солунян", [54] = "1 Тимофія",
        [55] = "2 Тимофія", [56] = "Тита", [57] = "Филимона", [58] = "Євреїв", [59] = "Якова",
        [60] = "1 Петра", [61] = "2 Петра", [62] = "1 Івана", [63] = "2 Івана", [64] = "3 Івана",
        [65] = "Юди", [66] = "Об'явлення"
    },
    KJV = {
        [40] = "Matthew", [41] = "Mark", [42] = "Luke", [43] = "John", [44] = "Acts",
        [45] = "Romans", [46] = "1 Corinthians", [47] = "2 Corinthians", [48] = "Galatians", [49] = "Ephesians",
        [50] = "Philippians", [51] = "Colossians", [52] = "1 Thessalonians", [53] = "2 Thessalonians", [54] = "1 Timothy",
        [55] = "2 Timothy", [56] = "Titus", [57] = "Philemon", [58] = "Hebrews", [59] = "James",
        [60] = "1 Peter", [61] = "2 Peter", [62] = "1 John", [63] = "2 John", [64] = "3 John",
        [65] = "Jude", [66] = "Revelation"
    }
}
